# Titanic Survival

#### Grading:


- Code: 90 pts
- Markdown Documentation: 10 pts

We are going to study the survival rate of passengers on titanic and what variables affected survival.

Load the dataset in `titanic.xls`. It contains data on all the passengers that travelled on the Titanic.

In [3]:
from IPython.core.display import HTML
HTML(filename='../data/titanic.html'),

In [40]:
# you would need xlrd - pip install xlrd
import pandas as pd
t_file = pd.ExcelFile('../data/titanic.xls')
t_df = t_file.parse("titanic")
t_df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

### Women and children first?

*** 1. Use the `groupby` method to calculate the proportion of passengers that survived by sex. (10 pts)***

### Grouping by sex and survived and using the sex column (no missing values)to calculate proportion of total survived.

In [58]:
(t_df.groupby(['sex','survived'])['survived'].count()/t_df['sex'].count())*100

sex     survived
female  0            9.702063
        1           25.897632
male    0           52.100840
        1           12.299465
Name: survived, dtype: float64

*** 2. Calculate the same proportion, but by class and sex. (10 pts)***

### The same thing can be achieved by adding `pclass` to the groupby statement

In [59]:
(t_df.groupby(['sex','pclass','survived'])['survived'].count()/t_df['sex'].count())*100

sex     pclass  survived
female  1       0            0.381971
                1           10.618793
        2       0            0.916730
                1            7.181054
        3       0            8.403361
                1            8.097785
male    1       0            9.014515
                1            4.660046
        2       0           11.153552
                1            1.909855
        3       0           31.932773
                1            5.729565
Name: survived, dtype: float64

*** 3. Create age categories: children (under 14 years), adolescents (14-20), adult (21-64), and senior(65+), and calculate survival proportions by age category, class and sex. (20 pts)***

### We can create the categories many different ways. I chose to use np.select simply because the code is better read this way. It assigns the category by evaluating a number of statements. The corresponding index of the true statement is matched the the corresponding index of the label in the second list.

In [61]:
import numpy as np
t_df['age_group'] = np.select([
    t_df['age'].between(0,13, inclusive = True),
    t_df['age'].between(14,20, inclusive = True),
    t_df['age'].between(21,64, inclusive = True),
    t_df['age'].between(65,999, inclusive = False),
],
[
    'children',
    'adolescents',
    'adult',
    'senior'
    
],
default = 'unknown_age')

t_df.groupby('age_group').count()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
age_group,,,,,,,,,,,,,,
adolescents,149,149,149,149,149,149,149,149,149,22,149,52,12,88
adult,784,784,784,784,784,784,784,784,783,228,782,306,100,526
children,99,99,99,99,99,99,99,99,99,15,99,57,2,61
senior,10,10,10,10,10,10,10,10,10,5,10,2,4,8
unknown_age,267,267,267,267,4,267,267,267,267,25,267,69,3,62

### Notice how there are 267 unknown_age. Was that because our np.select code is wrong? let's examine the data where age is unknown

In [31]:
t_df[t_df['age_group']=='unknown_age'].head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,age_group
15,1,0,"Baumann, Mr. John D",male,NaN,0,0,PC 17318,25.9250,NaN,S,NaN,NaN,"New York, NY",unknown_age
37,1,1,"Bradley, Mr. George (""George Arthur Brayton"")",male,NaN,0,0,111427,26.5500,NaN,S,9,NaN,"Los Angeles, CA",unknown_age
40,1,0,"Brewe, Dr. Arthur Jackson",male,NaN,0,0,112379,39.6000,NaN,C,NaN,NaN,"Philadelphia, PA",unknown_age
46,1,0,"Cairns, Mr. Alexander",male,NaN,0,0,113798,31.0000,NaN,S,NaN,NaN,NaN,unknown_age
59,1,1,"Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...",female,NaN,0,0,17770,27.7208,NaN,C,5,NaN,"New York, NY",unknown_age

### Just to double check, let's look at the missing values. 

It seems like there are 267 missing ages, so our categories are correct. Now all that needs to be done is to add the age category to the groupby statement in our previous code

In [32]:
t_df.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
age_group       0
dtype: int64

In [63]:
(t_df.groupby(['survived','sex','pclass','age_group'])['survived'].count()/t_df['sex'].count())*100

survived  sex     pclass  age_group
0         female  1       adult           0.305577
                          children        0.076394
                  2       adolescents     0.076394
                          adult           0.763942
                          unknown_age     0.076394
                  3       adolescents     1.222307
                          adult           3.666921
                          children        1.222307
                          unknown_age     2.291826
          male    1       adolescents     0.305577
                          adult           6.722689
                          senior          0.305577
                          unknown_age     1.680672
                  2       adolescents     1.145913
                          adult           9.014515
                          senior          0.152788
                          unknown_age     0.840336
                  3       adolescents     4.278075
                          adult          15.660810
                          children        1.909855
                          senior          0.152788
                          unknown_age     9.931245
1         female  1       adolescents     1.145913
                          adult           8.556150
                          senior          0.076394
                          unknown_age     0.840336
                  2       adolescents     0.916730
                          adult           5.042017
                          children        1.069519
                          unknown_age     0.152788
                  3       adolescents     1.451490
                          adult           2.902979
                          children        1.145913
                          unknown_age     2.597403
          male    1       adolescents     0.076394
                          adult           3.514133
                          children        0.381971
                          senior          0.076394
                          unknown_age     0.611154
                  2       adolescents     0.152788
                          adult           0.763942
                          children        0.840336
                          unknown_age     0.152788
                  3       adolescents     0.611154
                          adult           2.979374
                          children        0.916730
                          unknown_age     1.222307
Name: survived, dtype: float64